Revit 2027 API
DividedPath.IsCyclical Property
 True if the first and last point coincide False otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCyclical { get; }
Public ReadOnly Property IsCyclical As Boolean
	Get
public:
property bool IsCyclical {
	bool get ();
}
member IsCyclical : bool with get
Property Value
Boolean
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace